# The Series Data Structure

In [1]:
import pandas as pd

In [3]:
pd.Series?

In [4]:
animals = ['Tigers', ' Bear', 'Moose']

In [6]:
pd.Series(animals)

0    Tigers
1      Bear
2     Moose
dtype: object

In [7]:
numbers = [1, 2, 3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [8]:
animals = ['Tiger', 'Bear', None]
pd.Series(animals)

0    Tiger
1     Bear
2     None
dtype: object

In [15]:
numbers= [1,'hi', None] 
#None을 숫자 사이에 넣으면 NaN으로 들어간다
#None을 글자 사이에 넣으면 None으로 들어간다.
pd.Series(numbers) #Not a Number

0       1
1      hi
2    None
dtype: object

In [18]:
import numpy as np
np.nan ==None
np.isnan(np.nan)

True

In [20]:

sports = {'Archery': 'Bhutan', 
         'Golf': 'Scotland',
         'Sumo':'Japan',
         'Taekwondo': 'South Korea'}

In [21]:
sports

{'Archery': 'Bhutan',
 'Golf': 'Scotland',
 'Sumo': 'Japan',
 'Taekwondo': 'South Korea'}

In [28]:
s=pd.Series(sports)
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [26]:
s.index

Index(['Archery', 'Golf', 'Sumo', 'Taekwondo'], dtype='object')

In [31]:
s=pd.Series(['Tiger', 'Bear', 'Moose'], index=['India', 'America','Canada'])

# Pandas Querying

In [32]:

sports = {'Archery': 'Bhutan', 
         'Golf': 'Scotland',
         'Sumo':'Japan',
         'Taekwondo': 'South Korea'}
s=pd.Series(sports)
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [36]:
s.iloc[3]

'South Korea'

In [34]:
s.loc['Golf']

'Scotland'

In [37]:
s[3]

'South Korea'

In [38]:
s['Golf']

'Scotland'

In [39]:
s=pd.Series([100.00, 120.00, 101.00, 3.00])

In [41]:
s[0]

100.0

In [43]:
s.iloc[0]

100.0

In [44]:
total= 0
for item in s:
    total += item
print(total)

324.0

In [45]:
import numpy as np

total = np.sum(s)
print(total)

324.0

In [46]:
s = pd.Series(np.random.randint(0, 1000, 100000))

In [48]:
s.head()

0    273
1    489
2    604
3    772
4    789
dtype: int64

In [52]:
len(s)
s

0        273
1        489
2        604
3        772
4        789
5        301
6        900
7        699
8         30
9        970
10       273
11       408
12       230
13       322
14       606
15       285
16       331
17       396
18       619
19       716
20       656
21       257
22       300
23       236
24       198
25       342
26       769
27       533
28       953
29       400
        ...
99970    390
99971    944
99972    995
99973    620
99974    624
99975     19
99976    674
99977    424
99978    797
99979     77
99980    869
99981    165
99982    520
99983    873
99984    831
99985     89
99986     96
99987    198
99988    450
99989    659
99990    875
99991    350
99992    741
99993    648
99994    135
99995    852
99996    628
99997    852
99998    243
99999    460
Length: 100000, dtype: int64

In [51]:
%%timeit -n 100
summary=0
for item in s:
    summary+=item

100 loops, best of 3: 8.87 ms per loop

In [54]:
%%timeit -n 100
summary = np.sum(s)

100 loops, best of 3: 102 µs per loop

In [59]:
s += 2
for label, value in s.iteritems():
    s.set_value(label, value+2)
s.head()

0    285
1    501
2    616
3    784
4    801
dtype: int64

In [63]:
%%timeit -n 10
s = pd.Series(np.random.randint(0, 1000, 10000))
for label, value in s.iteritems():
    s.loc[label] = value+2

10 loops, best of 3: 644 ms per loop

In [65]:
%%timeit -n 10
s = pd.Series()
s+= 2

10 loops, best of 3: 282 µs per loop

In [67]:
s = pd.Series([1, 2, 3])
s.loc['Animal']='Bears'

In [68]:
s

0             1
1             2
2             3
Animal    Bears
dtype: object

In [69]:

sports = {'Archery': 'Bhutan', 
         'Golf': 'Scotland',
         'Sumo':'Japan',
         'Taekwondo': 'South Korea'}
s=pd.Series(sports)
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [70]:
cricket_locing_countries = pd.Series(['Australia', 'Barbados', 'Pakistan', 'England'], index=['Cricket', 'Cricket', 'Cricket', 'Cricket'])

In [73]:
all_countries = s.append(cricket_locing_countries)

In [74]:
all_countries

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
Cricket        Australia
Cricket         Barbados
Cricket         Pakistan
Cricket          England
dtype: object

In [75]:
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

# The DataFrame Data Structure

In [2]:
import pandas as pd
purchase_1 = pd.Series({'Name': 'Chris', 'Item Purchased': 'Dog Food', 'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn', 'Item Purchased': 'Kitty Litter', 'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod', 'Item Purchased': 'Bird Seed', 'Cost': 5.00})

In [5]:
df=pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store1', 'Store2', 'Store3'])

In [6]:
df

        Cost Item Purchased   Name
Store1  22.5       Dog Food  Chris
Store2   2.5   Kitty Litter  Kevyn
Store3   5.0      Bird Seed  Vinod

In [8]:
df.loc['Store2']

Cost                       2.5
Item Purchased    Kitty Litter
Name                     Kevyn
Name: Store2, dtype: object

In [9]:
type(df.loc['Store2'])

pandas.core.series.Series

In [10]:
df.loc['Store1']

Cost                  22.5
Item Purchased    Dog Food
Name                 Chris
Name: Store1, dtype: object

In [11]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})

df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])

In [12]:
df

         Cost Item Purchased   Name
Store 1  22.5       Dog Food  Chris
Store 1   2.5   Kitty Litter  Kevyn
Store 2   5.0      Bird Seed  Vinod

In [18]:
df['Item Purchased']

Store 1        Dog Food
Store 1    Kitty Litter
Store 2       Bird Seed
Name: Item Purchased, dtype: object

In [19]:
df.loc['Store 1', 'Cost']

Store 1    22.5
Store 1     2.5
Name: Cost, dtype: float64

In [21]:
df.T #transpose

                 Store 1       Store 1    Store 2
Cost                22.5           2.5          5
Item Purchased  Dog Food  Kitty Litter  Bird Seed
Name               Chris         Kevyn      Vinod

In [22]:
df.T.loc['Cost']

Store 1    22.5
Store 1     2.5
Store 2       5
Name: Cost, dtype: object

In [26]:
df.loc['Store 1']

         Cost Item Purchased   Name
Store 1  22.5       Dog Food  Chris
Store 1   2.5   Kitty Litter  Kevyn

In [1]:
df.loc['Store 1']

NameError: name 'df' is not defined

In [ ]:
          a